[
    {
        "title": "Добро пожаловать в Kenshi - REBORN Launcher!",
        "content": "Мы рады представить наш новый, специально разработанный лаунчер для сборки Kenshi - REBORN!\n\nЧто нового и почему это круто:\n\n* Автоматические обновления: Забудьте о ручной загрузке патчей. Лаунчер сам проверит и установит все свежие обновления сборки.\n* Удобный запуск: Запускайте игру и управляйте её состоянием прямо из лаунчера.\n* Простая активация: Легкая и быстрая активация вашего ключа доступа.\n* Логирование: Все действия лаунчера записываются в лог-файл, что упрощает поддержку и отладку.\n* Минималистичный дизайн: Приятный и интуитивно понятный интерфейс в пустынном стиле Kenshi.\n\nМы создали этот лаунчер, чтобы сделать ваш игровой опыт максимально комфортным и беспроблемным. Наслаждайтесь приключениями в мире Kenshi REBORN!"
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.0.8 уже здесь!",
        "content": "Мы рады представить вам новое обновление v6.0.8 для Kenshi REBORN! Это обновление привносит множество нововведений и исправлений, которые сделают ваше приключение в мире Kenshi еще более комфортным и увлекательным.\n\nЧто нового и что исправлено:\n\n* Комплект брони Импалера и комплект брони гидравлического рыцаря теперь доступны к созданию.\n* Исправлена проблема, когда окно с броней вылезало за пределы экрана после открытия болтокоробок.\n* Добавлены новые хранилища для различной электроники, такой как энергоядро, нанокабель, фазосталь, энергоиндуктор, ЦПУ и других.\n* Внесены небольшие корректировки.\n\nПеренос сохранения не требуется."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.0.7.1 уже здесь!",
        "content": "Мы продолжаем улучшать ваш игровой опыт в мире Kenshi REBORN и рады представить обновление v6.0.7.1! Это обновление включает в себя важные изменения и корректировки, направленные на улучшение баланса и экономики игры, а также небольшие исправления.\n\nЧто изменено в v6.0.7:\n\n* Внесены корректировки в цену простой аптечки, хорошей аптечки и стандартной аптечки.\n* Скорректирована цена пергамента, пергамента для чертежей и книг для исследований.\n* Изменено количество денег у большинства торговцев в игре в связи с выходом нового дополнения для сборки (ранее упакованный алкоголь было некому продавать из-за нехватки денег у NPC).\n\nЧто нового в v6.0.7.1:\n\n* Печь для переплавки теперь снова производит руду.\n* Внесены новые небольшие корректировки.\n\nОБЯЗАТЕЛЬНО НУЖНО СДЕЛАТЬ ПЕРЕНОС СОХРАНЕНИЯ, ИНАЧЕ ДЕНЬГИ У ТОРГОВЦЕВ ОСТАНУТСЯ БЕЗ ИЗМЕНЕНИЙ."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.0.6 уже здесь!",
        "content": "Мы продолжаем улучшать ваш игровой опыт в мире Kenshi REBORN и рады представить обновление v6.0.6! Это обновление включает в себя множество исправлений и улучшений, направленных на оптимизацию игрового процесса.\n\nЧто нового и что исправлено:\n\n* Внесены изменения в произрастание культур по биомам.\n* Печь для переплавки теперь производит слитки железа.\n* Ящик для хранения кольчуг стал доступен.\n* Хранилище пиломатериалов разделено на контейнер для досок и контейнер для брусов.\n* Исправлена вместимость контейнера с железными листами.\n* Убраны проблемные места у Башни Пыльного Короля.\n* Исправлен Ткацкий станок [конопля].\n\nПеренос сохранения не требуется."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.0.5 уже здесь!",
        "content": "Мы продолжаем улучшать ваш игровой опыт в мире Kenshi REBORN и рады представить обновление v6.0.5! Это обновление включает в себя множество исправлений, улучшений и новый контент, которые сделают ваши приключения еще более захватывающими.\n\nЧто нового и что исправлено:\n\n* Расширен ассортимент в магазине кибернетики.\n* Добавлена анимация атаки Болотной черепахи.\n* Внесены корректировки в прочность конечностей черепахи, шанс попадания по конечностям, а также в характеристики.\n* Убрана потребность в рабочем у Печи для переплавки.\n* Добавлена новая вариация для Башни Пыльного короля.\n* Простая аптечка теперь создается не из 5 хлопка, а из 3, что сказалось на цене.\n* Самурайские доспехи, которые отсутствовали в списке создаваемых предметов, теперь там есть и доступны к созданию.\n* Внесены мелкие корректировки и исправления."
    },
    {
       "title": "Обновление Kenshi REBORN до версии v6.0.4 уже здесь!",
       "content": "Мы продолжаем улучшать ваш игровой опыт в мире Kenshi REBORN и рады представить обновление v6.0.4! Это обновление направлено на исправление ошибок и недочетов, а также добавляет новый функционал, который сделает ваши приключения еще более увлекательными.\n\n  Что нового и что исправлено:\n\n* Исправления недочетов:\n    * Теперь у доспеха Адзути (синий) появилась корректная иконка.\n    * Улучшено отображение интерьера здания в локации Красное логово, больше никаких кривых стен!\n    * Заменено нефункциональное яйцо краба на рабочую версию с текстурой и иконкой.\n    * Исправлено нахлест здания на скалу в локации Пик хребта.\n    * Переработан интерьер в больнице города Стопка для более комфортного пребывания.\n\n* Расширение игрового мира:\n    * Расширен ассортимент в магазине кибернетики в городе Край Мира.\n    * НПС Мани теперь торгует различными ценными предметами.\n\n* Новые возможности:\n    * Добавлены новые методы обучения навыкам, открывающие больше путей для развития ваших персонажей.\n    * Появились новые технологии и чертежи, позволяющие создавать оборудование для обучения навыков.\n\nПеренос сохранения не требуется! Вы можете продолжить свои приключения без каких-либо проблем."
    }
]
