[
    {
  "title": "Обновление Kenshi REBORN до версии v6.5.4,0",
  "content": "Странники, всем привет! 👋\n\nВыпускаем обновление v6.5.4,0! В этот раз мы сосредоточились на возвращении знакомых лиц и правках внутриигровой экономики.\n\n👥 Возвращение персонажей\n\nМы вернули на свои места (или в ротацию) нескольких NPC, которых вы могли потерять:\n- Доктор Чон снова находится в городе Акула.\n- Орон вернулся! Теперь его можно встретить в случайном баре на территории Шеков.\n- Седая Тень снова ожидает вас в городе Край Мира.\n\n🛠️ Торговля и Исправления\n\n- Ресурсы: В торговые листы фермерских и универсальных магазинов возвращены брёвна.\n- Святая Нация: Скорректировано количество ресурсов, доступных для покупки у торговцев этой фракции.\n- Недвижимость: Исправлено несоответствие стоимости домов, выставленных на продажу.\n\nВАЖНО: Для корректного появления персонажей и обновления магазинов ПЕРЕНОС ИГРЫ ОБЯЗАТЕЛЕН!\n\n⚠️ ОБРАТИТЕ ВНИМАНИЕ:\n\nПроверяйте актуальность версии сборки! Если у вас вылетает игра при строительстве песчаного рудника — значит, установлена старая версия. Обновитесь.\n\nСторонние моды: Мы не несём ответственности за ошибки при использовании сборки со сторонними модами. Если сообщаете о багах при наличии других модов — ОБЯЗАТЕЛЬНО УПОМИНАЙТЕ ОБ ЭТОМ!"
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.5.3,0",
  "content": "Странники, всем привет! Мы к вам с обновлением v6.5.3,0!\n\nОбновление с исправлениями ошибок.\n\nПОДРОБНЕЕ:\n- Добавлены семена в трейд-листы фермерских магазинов. Виды семян в продаже зависят от фракции.\n- Скорректировано количество катов у скупщиков краденого.\n- Добавлены в продажу болты для нагревательного арбалета.\n- В Пойме добавлен арсенал со скелетами серии XT-MKIII и XT-MKIV, которых можно нанять для защиты отряда и форпоста, а также зарекрутировать.\n- Молекулярная кузня теперь не требует высоких навыков для изготовления Фантома Древних и Артефакта Древних.\n- Добавлен новый класс оружия \"Артефакт Древних\", который может критануть при изготовлении Фантома Древних.\n- Скорректирован список ресурсов, необходимых для постройки научного стенда 7 уровня.\n\nИСПРАВЛЕНИЯ:\n- Исправлен Жукодом на продажу в Грузе.\n- Исправлен вход в бар в Южном каменном лагере, добавлены бары в пустующие заставы.\n- Различные мелкие правки.\n\nПеренос игры обязателен."
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.5.2,0",
  "content": "Странники, всем привет! Мы к вам с обновлением v6.5.2,0!\n\nПОДРОБНЕЕ:\n\n- Изменено время восхода и заката на 07:00 и 21:00 соответственно для более корректной работы уличного освещения.\n- В ассортимент строительных и универсальных магазинов добавлены ресурсы: камень, песок, щебень и уголь.\n- Путевая станция «Последний Обвал» переименована в «Последний привал».\n- Проведена работа над строениями станции, полностью изменён интерьер бара в «Последнем привале».\n- В баре «Последнего привала» теперь можно встретить Тоса — уникального высокоуровневого рекрута-арбалетчика, добавленного по заказу нашего подписчика.\n\nИСПРАВЛЕНИЯ:\n\n- Исправлена торговля контрабандой у воров шиноби.\n- Исправлен агро-верстак: теперь при работе используется навык фермерства вместо инженерии.\n- Исправлено застревание персонажей в кроватях баров, расположенных в зданиях типа «Застава C-IV».\n- Исправлен мост у порта Юг.\n- Исправлен магазин доспехов в Скуине.\n\nПЕРЕНОС СОХРАНЕНИЯ ОБЯЗАТЕЛЕН."
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.5.1,0",
  "content": "Странники, всем привет! Мы к вам с обновлением v6.5.1,0!\n\nМы отвлеклись от глобального ребаланса всего и вся, в пользу наполненности мира. В нём, много удалённых и незавершённых локаций. На данный момент, мы разбираемся с тем, что вообще творится в мире, что где расположено (на минуточку в игре что-то около 600 зон, которые были добавлены или изменены генезисом и нами), чтобы в будущем понимать с чем работать. Это необходимо для восстановления того, что должно быть, но было сломано, удалено или сделано криво, и удаления лишнего к выходу версии 7.0.0, и восстановления адекватной войны с фракциями в последующих версиях.\n\nПоэтому пока в обновлениях не будет каких-то грандиозных изменений, а в основном исправления ошибок, о которых вы нам сообщаете, и какие-то дополнительные правки.\n\nПОДРОБНЕЕ:\n\n- Добавлен мод \"No Modern Underwear\" от Manic — ретекстур тела, меняющий нижнее бельё.\n- Изменено описание одомашненных животных, дающее понимание их назначения.\n- Скорректирована ночная темнота: теперь ночи немного светлее.\n\nИСПРАВЛЕНИЯ:\n\n- Исправлены лишние повторения исследований, которые ничего не открывают.\n- Исправлены недостающие повторения исследований, которые открывают дополнительне постройки.\n- Исправлена продуктивность Колодца I, ранее она была как у самого прокачанного.\n- Исправлены требуемые материалы для Защитных стен V и пандусов.\n- Исправлена привязка к расе доспехов роев, ограничивающая её использование другим расам.\n- Исправлено поселение грогеров Семолина.\n- Исправлен вход в Древнее хранилище 3.\n- Исправление опечаток в переводе.\n\nПеренос сохранения ОБЯЗАТЕЛЕН."
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.5.0,0",
  "content": "Странники, всем привет! Мы рады представить масштабное обновление v6.5.0,0, которое порадует любителей колоссальных построек!\n\nДля любителей колосальных построек были добавлены новые каркасные конструкции, мосты и дороги.\n\nК сожалению, из-за отсутствия опыта работы с коллизиями, возможности строить верстаки и хранилища прямо на них добавить не удалось. Но свои постройки можно размещать на них, перемещая через внутриигровой редактор **Shift + F12**. Инструкцию, как им пользоваться, можно найти в группе ТГ и Дискорде. Разобраться в нём не сложно и это даст большие возможности в постройке интересных форпостов.\n\nПОДРОБНЕЕ:\n\n- Добавлен в категорию ДОРОГИ мост со щитами. Доступен при изучении Защитных стен III.\n- Добавлены в категорию ДОРОГИ каменные дороги и мосты.\n- Добавлена категория КОНСТРУКЦИИ с постройками из мода CMRoadAddOn Ver2.\n- Исправлены текстуры для новых построек.\n- Сделаны новые иконки с использованием нормальных текстур.\n- Переделана структура групп в режиме строительства для новых построек.\n- Сделаны понятные описания для новых построек.\n- Добавлены исследования для новых построек.\n- Скорректированы необходимые ресурсы для строительства для новых построек.\n- Добавлены исследование на открытие болотных зданий и платформ.\n- Скорректированы необходимые ресурсы для строительства болотных зданий и платформ.\n\nИСПРАВЛЕНИЯ:\n\n- Добавлена возможность железнобоким использовать броню друг друга.\n- Добавлены освещение и анимированная мебель в штабе Адмага.\n\nПеренос сохранения ОБЯЗАТЕЛЕН."
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.9,5",
  "content": "Мы к вам с обновлением v6.4.9.0! Список изменений в этот раз небольшой, но важный.\n\nЭксклюзив в Discord: Форум с модами\n\nДля тех, у кого есть доступ к сборке, мы открыли специальный раздел на сервере — «Доп-файлы»! Там мы публикуем моды, которые были специально адаптированы под сборку, но по разным причинам не вошли в основной состав. Теперь вы можете скачать эти дополнения опционально и протестировать их самостоятельно!\n\nИзменения в v6.4.9.0\n\n- Иконки: Мы вернули иконки, обработанные через AI. Если вам больше по душе исправленные оригинальные варианты — теперь их можно найти и скачать как опциональный мод в нашем Discord (в новом разделе!).\n- Магазины: Увеличено количество предметов в ассортименте Короля Доспехов и в Хламилище. Время обновления товаров теперь составляет 7 дней.\n- Рюкзаки: Добавлены и распределены новые рецепты рюкзаков, а также скорректированы их цены.\n- Исправление: Наконец-то исправлен баг с постоянным дебаффом \"работа в темноте\".\n\nВАЖНО: Для обновления ассортимента магазинов ПЕРЕНОС ИГРЫ ОБЯЗАТЕЛЕН!\n\nДа пребудет с вами Пустошь."
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.8,0",
  "content": "Мы рады представить вам обновление v6.4.8,0! Наконец-то работа над переработкой производства одежды и доспехов завершена!\n\nНу, что ж, поскольку сборка много раз переделывалась, добавлялись новые моды, общее количество предметов для крафта увеличилось во множество раз относительно оригинальной игры. Образовался беспорядок и захламлённость, что вызывало дискомфорт во время игры.\n\nБыла проделана большая работа по переделыванию исследований, переосмыслению каким образом будут открываться для крафта одежда и доспехи, перераспределению их по старым и новым производственным станциям. Выстроен порядок в списках крафта: в начале комплекты, изучаемые с помощью чертежей, затем всё остальное преимущественно по алфавиту. При изучении производства вам откроется доступ только к производственным станциям, предметы для крафта изучаются отдельно. Сделано это, чтобы максимально разгрузить список крафта и в нём не было ничего лишнего. При изучении доспехов, обращайте внимание на требуемую технологию, по ней можно будет понять, на какой станции они производятся.\n\nВ общем, было сделано всё, чтобы навести порядок и организовать комфортное производство.\n\nПоскольку большинство исследований/чертежей было полностью переделано и были добавлены новые, скорее всего возникнут проблемы с изученными чертежами и исследованиями. К сожалению, без этого было не обойтись, нужно будет заново их изучить.\n\nПОДРОБНЕЕ:\n\n- Добавлена защита дополнительных частей тела для клинков убийцы с небольшой областью покрытия.\n- Возвращены воровские рюкзаки.\n- Добавлен мод Building Collision Fix на фикс невидимой стены в у-доме (автор SCARaw).\n- Переведён и добавлен мод Swamper Plate, добавляющий новую вариацию обносков убийцы (автор Trinity).\n- Переведён и добавлен мод Hack Stopper Shoes, добавляющий неразрубаемые боты (автор No Souls Unturned).\n- Добавлен мод Female Hack Stopper Fix на фикс неразрубаемой куртки (автор IcyCheeseCake).\n- Добавлен мод Ninja Mask на фикс маски ниндзя (автор Grunick).\n- Отцентрированы и заново сгенерированы все иконки одежды и доспехов.\n- Переработаны все исследования по производству одежды и доспехов.\n- Переработан порядок в списках крафта одежды и доспехов.\n- Изменена моделька кузни реставратора.\n- Добавлен новый верстак кожевника с бронелистами для крафта кожаных доспехов с латами.\n- Добавлен новый верстак для плетения из пшеницы для крафта соломенных шляп и сандалий.\n- Добавлено ограничение по тех уровню для рейдов бандитов. Теперь большинство бандитов будет нападать при достижении 2 тех. уровня, некоторые при достижении 1 (постройки стола 1 тех. уровня).\n\nИСПРАВЛЕНИЯ:\n\n- Исправлено отсутствие защиты от опаления у пыльника с доспехами.\n- Исправлены бонусы навыков пальто и пыльника с доспехами.\n- Исправлен перевод диалога Дуги.\n- Убраны из продажи чертежи доспеха Гусоку (предполагалось, что они будут находиться в древних руинах). В будущем он будет перебалансирован под высокоуровневую броню с повышенной защитой.\n\nПЕРЕНОС СОХРАНЕНИЯ ОБЯЗАТЕЛЕН."
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.7,1",
  "content": "Мы рады сообщить о выходе обновления v6.4.7,0 для Kenshi REBORN! Работа над переработкой системы производства практически завершена, и это обновление вносит ряд важных изменений, связанных с фракцией Святой Нации и балансом предметов.\n\nРабота над переработкой производства почти завершена, осталось доделать чертежи и разложить их по торговцам, а так же составить порядок в списках крафта у верстаков.\nТем не менее, у нас есть что вам показать...\n\nПОДРОБНЕЕ:\n\n- Изменены фракционные цвета для брони Святой Нации, возвращая их к оригинальным с небольшими правками.\n- Скорректированы характеристики некоторых типов брони Святой Нации.\n- Скорректированы виды одежды и доспехов Святой Нации.\n- В городах Святой Нации теперь продаётся в основном простая и фракционная одежда и броня, а также чертежи для их изготовления (в будущем будут дополнены).\n- Изменено количество денег и предметов для продажи у уличных торговцев.\n- Переработаны характеристики фракционных щитов: теперь есть смысл их использовать по аналогии устройств.\n- Добавлен \"сундук для моторов\" и \"сундук для деталей скелетов без моторов\" для тех, у кого проблемы с забиванием инвентаря инженеров. (временное решение)\n\nИСПРАВЛЕНИЯ:\n\n- Исправлено отсутствие гражданских в Стопке.\n- Исправлена иконка Книги Лун.\n\nВнимание: Перенос игры обязателен, чтобы перезагрузились СН!\n\nОбновление v6.4.7,1\nНезначительные изменения"
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.6,0",
  "content": "Рады сообщить о выходе обновления v6.4.6,0 для Kenshi REBORN! Основной фокус — подготовка к масштабной переработке крафта брони, а также ряд важных исправлений и дополнений.\n\nВедётся работа над переработкой крафта брони. Патч, в основном, вносит исправления и не большие дополнения.\n\nПОДРОБНЕЕ:\n\n- Добавлена «Кузня реставратора» для изготовления «примитивных» тяжёлых доспехов, таких как латные обноски.\n- Добавлены рецепты разных вариаций примитивных тяжёлых доспехов в исследование «Ковка латных доспехов».\n- Переименована часть модовских аналогов ванильной брони для соответствия названиям из оригинальной игры.\n- Добавлены «книги кулинарных рецептов» в библиотеку Чёрной Ссадины.\n\nИСПРАВЛЕНИЯ:\n\n- Исправлены иконки оружия Нахаль.\n- Исправлена невозможность крафта набора брони техохотника.\n- Исправлена невозможность постройки Постового здания после изучения Больших зданий.\n- Исправлена деревня культистов.\n- Множество исправлений перевода.\n\nПеренос сохранения не обязателен."
},
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.5,0",
  "content": "Мы рады объявить о выходе обновления v6.4.5,0 для Kenshi REBORN, которое вносит ряд дополнений в геймплей и исправлений.\n\nПОДРОБНЕЕ:\n\n- Добавлено \"Место для сна\" в разделе ЛАГЕРЬ, как примитивная альтернатива спальнику.\n- Добавлен \"Мешок для фуражирования\" в разделе ЛАГЕРЬ, позволяющий автоматически облутывать все виды животных через задачу \"разделать\".\n- Добавлена возможность готовить некоторые простые блюда на костре.\n- Возвращены модификаторы навыков у лёгкой обуви, вроде сандалей.\n- Добавлены исследования, открывающие возможность построить предметы интерьера следующих модов: Random Furniture, KillingTime, CBT Leisure Objects and Furniture, нацеленные оживить атмосферу форпоста.\n\nИСПРАВЛЕНИЯ:\n\n- Удалены яйца гурчащих, так как они были заменены на яйца рыболюда и нигде не использовались.\n- Исправлена иконка яиц рыболюда.\n\nПеренос сохранения не обязателен."
    },
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.4,0",
  "content": "Мы рады объявить о выходе обновления v6.4.4,0 для Kenshi REBORN, которое вносит ряд важных исправлений баланса, связанных со строительством, а также добавляет новый функционал для животных!\n\nОСНОВНЫЕ ИЗМЕНЕНИЯ:\n\n- Исправлен дефицит ресурсов, необходимый для начала строительства базы. (см. подробный список изменений ниже)\n- Была добавлена «броня» для животных — по сути это рюкзак с небольшим инвентарём для еды, улучшающий боевые навыки. К сожалению, движок не позволяет полноценные доспехи для животных. По какой-то причине, животных в ней периодически убивают с одного удара. Рюкзаки — временное решение (или нет, если не удастся это исправить).\n- Чертеж рюкзака для собак можно найти у Сэта (уникальный напарник в компании с лютоволком по кличке Брук) и в библиотеке Чёрной Ссадины.\n- Рюкзак для быков можно исследовать после изучения чертежа рюкзака для собак.\n\nПОДРОБНЕЕ:\n\n- Поправлен список предметов, разбросанных вокруг домов в руинах ферм и шахт. Теперь там можно найти в основном различные стройматериалы.\n- Добавлен «росток дерева» торговым караванам, которые продают фермерские товары.\n- Поправлено количество ресурсов, продаваемых в строительных и фермерских магазинах и караванах.\n- Убраны из продажи фермерских магазинов рюкзаки для экзотических животных. Купить их можно у торговца экзотическими животными.\n- На фермах Святой Нации продаются ресурсы, производимые в их регионе.\n- Убрана возможность постройки «Научного стенда ур.1», его функцию выполняет «Стол для планирования».\n- Добавлено улучшение «Стола для планирования», открывающее доступ ко второму тех уровню.\n\nИСПРАВЛЕНИЯ:\n\n- Исправлен корявый перевод диалога Сэта.\n- Исправлены мелкие недоработки перевода.\n- Исправлено производство стройматериалов: теперь изготовленные предметы стакаются.\n- Исправлен город Столица людоедов.\n- Исправлен город Строка.\n- Исправлен Город-архив.\n- Исправлен купол на Безымянных островах.\n- Исправлена невидимая стена в разрушенной лаборатории в Мщении.\n- Добавлен свет в баре контрабандистов в Симе.\n- Исправлены невидимые стены в Грани.\n- Поправлен город Оседлых кочевников.\n- Исправлены невидимые стены на Базе охотников на людей.\n- Исправлен висящий в воздухе генератор в городе Левиафан.\n\nПеренос сохранения ОБЯЗАТЕЛЕН."
    },
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.3,0",
  "content": "Мы рады представить крупное обновление v6.4.3,0 для Kenshi REBORN, которое полностью завершает переработку строительной системы и баланса ресурсов!\n\nПРЕДИСЛОВИЕ\n\nНовая система строительства направлена усложнить игровой процесс при строительстве своего форпоста. Теперь его постройка это не такое быстрое и простое дело, но старания будут оправданы. Ищите временные решения, выстраивайте производственные цепочки необычными способами, прежде чем построить что-то грандиозное.\nВ дальнейшем мы будем постепенно добавлять дополнительные постройки, чтобы внести разнообразие в этот процесс.\n\nВАЖНО ДЛЯ ПРОЧТЕНИЯ\n\n- Завершена работа над списками ресурсов для построек. После обновления ваши инженеры начнут перестраивать эти постройки, нужно подождать когда они завершат этот процесс.\n- Были исправлены ошибки, связанные с хранилищами и не только. После обновления в некоторых из них могут пропасть определённые предметы, чтобы этого избежать, прочитайте подробный список изменений.\n\nПОДРОБНЕЕ:\n\n- Возвращено раздельное хранение ножовок и инструментов из-за возникновения проблем с забиванием инвентаря персонажей. (Перед обновлением уберите из \"Ящика для инструментов\" ножовки, иначе они пропадут.)\n- Исправлены проблемы с текстурами оружия людоедов.\n- Загоны для животных в режиме строительства перенесены в категорию ФЕРМЕРСТВО.\n- Переработана выработка электричества генераторами. Теперь есть смысл строить топливные генераторы.\n- \"Солнечный генератор\" больше не расходует конденсаторы, но требует один для работы. Можно улучшить до \"Солнечно солевого генератора\".\n- Убрана возможность строить отдельные хранилища для конденсаторов и конденсаторный верстак.\n- Увеличение прочности ворот.\n- Добавлены вариации \"Защитных стен III и IV\" из старых версий игры.\n- Теперь можно улучшить \"Защитная стена IV\" до \"Защитная стена V [старое]\", без наслаивания мешей из-за разницы в размерах.\n- Налажены постройки из категории \"ТОРГОВЛЯ\". Хранилища имеют функцию прилавка, скорректирована их вместимость. Ларьки теперь строятся не случайно, а выбирается конкретная моделька перед постройкой.\n- Наведён порядок в категории \"СВЕТ\".\n- Прочие правки и исправления ошибок.\n\nПеренос сохранения ОБЯЗАТЕЛЕН."
    },
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.2,0",
  "content": "Мы рады представить новое обновление v6.4.2,0 для Kenshi REBORN, которое вносит масштабные изменения в строительную систему и хранилища!\n\nВАЖНО ДЛЯ ПРОЧТЕНИЯ\n\n- Были исправлены ошибки, связанные с хранилищами. После обновления в некоторых из них могут пропасть определённые предметы. Чтобы этого избежать, пожалуйста, прочитайте подробный список изменений ниже.\n- Переработаны списки ресурсов для построек из категорий ГОТОВКА и ИЗДЕЛИЯ. После обновления ваши инженеры начнут перестраивать эти постройки, вам нужно будет дождаться завершения этого процесса.\n\nПродолжается работа над постройками со старыми списками ресурсов.\n\nПОДРОБНЕЕ:\n\n- Добавлены небольшие контейнеры объёмом на 25 для хранения железной и медной руд, железных листов, угля, песка и камня. Они занимают меньше места и дешевле для постройки на начальных этапах.\n- Увеличено количество камня, необходимое для создания кирпичей (соотношение 2 к 1).\n- Добавлен мотор в список товаров «Универсальных магазинов». Его можно найти там с некоторым шансом.\n- Изменены списки необходимых материалов для построек из категорий ГОТОВКА и ИЗДЕЛИЯ.\n- Исправлен расход конденсаторов «Солнечным генератором».\n- Убрана/добавлена потребность в электричестве верстакам, чтобы логически соответствовать их моделькам.\n- Сделан отдельный ящик для пергаментов.\n- Увеличена вместимость «Ящика для угольных мелков» до 100.\n- Убраны угольные мелки и пергаменты из списка хранения «Книжной полки», которые вызывали проблемы с заполнением инвентаря персонажей и остановки процесса производства. (ОБЯЗАТЕЛЬНО УБЕРИТЕ ИХ ИЗ НЕЁ ПЕРЕД ОБНОВЛЕНИЕМ, ИНАЧЕ ОНИ ПРОПАДУТ.)\n- Внесены мелкие правки перевода и недочётов.\n\nПЕРЕНОС СОХРАНЕНИЯ ЖЕЛАТЕЛЕН."
    },
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.1,2",
  "content": "Мы рады представить новое обновление v6.4.1,2 для Kenshi REBORN, которое фокусируется на улучшениях хранилищ и исправлении протезов.\n\nЧто нового и что исправлено:\n\n* Увеличен объём Бочки для кактусов до 250.\n* Исправлен Сундук для доспехов, который ранее было невозможно использовать.\n* Убраны инструменты и конденсатор из Сундука для деталей скелетов. Перед обновлением уберите их из него, иначе они пропадут.\n* Для шарниров сделан отдельный сундук. Перед обновлением уберите их из Сундука для деталей скелетов, иначе они пропадут. (Сделано, чтобы персонажи не таскали их между хранилищами. Если у вас имеется Сундук для арбалетных деталей, лучше используйте только его для хранения шарниров).\n* Добавлены недостающие блюда в список хранения Бочки для еды.\n* Поправлен размер окон инвентаря у складских коробок и вешалки для доспехов.\n* Исправлено отсутствие в списке крафта протезов ног-клинков Тип II и рук-клинков.\n* Поправлено значение прочности всех протезов-клинков, добавлена зависимость от их качества.\n\nПеренос сохранения не обязателен.\n\nОбновление v6.4.1,3\nНезначительные изменения\n\nОбновление v6.4.1,4\nНезначительные изменения"
    },
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.1,1",
  "content": "Мы рады представить новое обновление v6.4.1,1 для Kenshi REBORN, которое приносит важные изменения в систему строительства и баланса!\n\nПРИМЕЧАНИЯ:\n\nБыл проведён полный перерасчёт баланса ресурсов, необходимых для построек. В настоящее время полностью переработана категория ХРАНЕНИЕ. Теперь большинство хранилищ можно улучшать до более вместительных, но и более дорогих версий. Не спешите сразу строить хранилища максимального уровня, если у вас нет большого запаса ресурсов.\n\nПЕРЕНОС СОХРАНЕНИЯ ЖЕЛАТЕЛЕН.\n\nПосле обновления ваши инженеры начнут «перестраивать» ваши постройки. Визуально и функционально ничего не изменится, просто дождитесь, пока они завершат процесс.\n\nПОДРОБНЕЕ:\n\n* Возвращены ранее удалённые вариации улучшаемых хранилищ упакованного урожая.\n* Печь для переплавки теперь снова производит железные слитки.\n* Исправлен неправильный объём некоторых хранилищ.\n* Теперь в хлебную корзину можно складывать только ингредиенты (хлеб, рисовый хлеб, ломтик хлеба, лаваш). Это сделано для удобства налаживания автономного процесса, так как ранее корзина могла забиться готовой едой.\n* Хранилищам добавлено отображение названий хранящихся ресурсов.\n* Увеличен объём хранилищ базовых ресурсов, которые наиболее востребованы при строительстве.\n* Изменены списки необходимых материалов для построек из категории ХРАНЕНИЕ, которые не были скорректированы под систему новых ресурсов (работа над остальными категориями продолжается).\n* Исправлена невозможность крафта: поясного колчана, наборов доспехов Адзути, крабовых доспехов, доспехов Гусоку, необычного самурайского доспеха, людоедских доспехов, латных доспехов роя, доспехов Импалера, доспехов Чёрного Панциря и других.\n* Внесены мелкие правки в перевод и исправлены недочёты."
    },
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.1,0",
  "content": "Мы рады представить новое обновление v6.4.1,0 для Kenshi REBORN, которое вносит ряд важных изменений и исправлений.\n\nЧто нового и что исправлено:\n\n* Добавлена рабочая кормушка для животных (только для корма). Старую версию необходимо удалить.\n* Удалено сырое мясо из списка хранения для кормушки животных (вся еда). Чтобы мясо не исчезло после обновления, его нужно переместить в другое хранилище.\n* Скорректирована вместительность хранилищ (мешки для семян и контейнеры для упакованного урожая). Также были удалены лишние вариации последнего контейнера. Перед установкой обновления желательно очистить эти хранилища.\n* Объединены два хранилища (для ножовок и инструментов) в одно. Стандартное хранилище ножовок было удалено. Требуется его очистка перед установкой.\n* Печь для переплавки теперь снова производит руду. Переплавка в слитки нарушала установленный баланс.\n* Исправлено место застревания в Тщете. Теперь там можно свободно передвигаться, не опасаясь за свои нервы.\n\nПЕРЕНОС СОХРАНЕНИЯ ЖЕЛАТЕЛЕН."
    },
    {
  "title": "Обновление Kenshi REBORN до версии v6.4.0,1",
  "content": "Мы рады сообщить о выходе нового обновления v6.4.0,1 для Kenshi REBORN. Это обновление вносит ряд важных внутренних изменений и продолжает серию улучшений, начатых в версии v6.4.0,0.\n\nПЕРЕД ОБНОВЛЕНИЕМ И ПЕРЕНОСОМ СОХРАНЕНИЯ (для версии v6.4.0,0):\n\nЕсли вы не начинаете новую игру, переложите все упаковки из «Мешков для семян и упаковок», иначе они будут утеряны.\n\nЧто нового и что исправлено в v6.4.0,0:\n\n* Восстановлена ванильная карта теней. Модовская версия была слишком тёмной, и некоторые объекты выглядели чрезмерно затемнёнными, что могло утомлять глаза.\n* Исправлены отсутствующие окончания в именах и диалогах.\n* Переписан ИИ стражей ворот: теперь на посту стоят только пятеро, а остальные патрулируют город. При опасности они приходят на помощь товарищам. (Если заметите странности — просьба сообщить в Discord или Telegram).\n* Скорректированы категории и описания исследований и режима строительства для упрощения навигации.\n* В описания хранилищ, где это отсутствовало, добавлен размер инвентаря.\n* Переведён и добавлен мод \"Storm Walls\" от StarCornet — он добавляет каменные стены, которые хорошо сочетаются с большинством зданий и отлично подойдут для ранних этапов.\n* Переведён и добавлен мод \"Tight Rags\" от NANOU — он заменяет тканевые обмотки на более детально проработанные. Их можно найти у NPC или изготовить самостоятельно после изучения «Производство одежды».\n* Скорректировано снаряжение голодных и пыльных бандитов (визуальные изменения).\n* Понижен уровень экипировки Банды Костей: теперь низкий/средний (ранее был средний/хороший).\n* Актуализированы списки материалов для некоторых построек под систему новых ресурсов (балансировка продолжается).\n* Подправлены посадки зеленофрукта, конопли и риса, чтобы они не выходили за пределы ограждений.\n* Добавлено улучшение зеленофруктовой и конопляной ферм с размера L до XL.\n* Ребаланс гидропоник: теперь они выглядят более «живыми» и дают стабильный урожай в 72 единицы.\n* Обновлены модели некоторых хранилищ и добавлены новые варианты из предыдущих версий.\n* Для семян и упаковок урожая теперь введены отдельные хранилища.\n* Исправлен ряд мелких ошибок и недоработок, добавлены новые элементы.\n\nЧто нового в v6.4.0,1:\n\n* Внесены внутренние исправления и оптимизации.\n\nПЕРЕНОС СОХРАНЕНИЯ ОБЯЗАТЕЛЕН.\n\nВАЖНО: Некоторые старые исследования могут дублироваться, не открывая ничего нового. Просто проигнорируйте их или начните новую игру, чтобы всё работало корректно."
    },
    {
       "title": "Обновление Kenshi REBORN до версии v6.3.1,2",
       "content": "Мы продолжаем улучшать Kenshi REBORN и рады представить обновление v6.3.1,2, которое вносит ряд важных исправлений и изменений.\n\nЧто нового и что исправлено в v6.3.1,0:\n\n* Улучшено хранилище 'Бочка с едой', теперь в него можно поместить больше видов блюд.\n* Расширен ассортимент в универсальных и строительных магазинах: добавлены **щебень** и **песок**.\n* Изменен внешний вид скелетов в городе Чёрная Пустыня.\n* Переработана ценовая политика Скелетов.\n* Исправлен интерьер робототехнического магазина в городе Чёрная Пустыня.\n\nЧто нового и что исправлено в v6.3.1,1:\n\n* Исправлена проблема с тренажерами восприятия, которые при улучшении ошибочно превращались в тренажеры турелей.\n* Повторно скорректирована ценовая политика Скелетов.\n* Частично перестроен город Тщета для устранения багов с поиском пути.\n\nЧто нового и что исправлено в v6.3.1,2:\n\n* Исправлены анимации атаки у оружия Гуань дао и некоторых типов скелетов.\n* Увеличена вместимость складских ящиков.\n* Внесена корректировка в цену продажи гашиша в Ровной Лагуне.\n* Исправлен недочет: теперь при работе на маленькой железной породе корректно прокачивается навык силы.\n\nПеренос сохранения **желателен при установке версии v6.3.1,1**."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.3.0,0 уже здесь!",
        "content": "Мы рады представить вам новое обновление v6.3.0,0 для Kenshi REBORN! Это обновление привносит долгожданное продолжение квестовой цепочки, а также множество важных улучшений и исправлений.\n\nЧто нового и что исправлено:\n\n* Главное изменение — это продолжение квестовой цепочки Хаба, стала доступна вторая стадия восстановления. Чтобы начать, вам нужно найти Клейтона в городе и поговорить с ним. Если вы уже прошли первую стадию, найдите Мелборна или Шефа Грау.\n* Локация Болото была поделена на зоны (заросшие, средне заросшие и не заросшие), что улучшило игровой опыт (лишняя растительность больше не мешает камере) и позволило отстраивать базы. Это также частично повлияло на производительность.\n* По отзывам игроков были добавлены и улучшены хранилища: бочка с едой, бочка с плохим сырым мясом, ящик с протезами, ящик для болванок.\n* Также были исправлены следующие проблемы:\n    * Убрана возможность перехода с угольного бура на медный.\n    * Обучение рубачам больше не тренирует скрытность.\n    * Внесены другие небольшие корректировки и изменения.\n\nПеренос сохранения не требуется."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.2.0,0 уже здесь!",
        "content": "Мы рады представить вам новое обновление v6.2.0,0 для Kenshi REBORN! Это обновление стало результатом огромной работы, направленной на улучшение баланса, производительности и стабильности сборки.\n\nЧто нового и что исправлено:\n\n* Произведена ценовая балансировка более 200 единиц оружия с использованием формулы: `BasePrice = 175 * ((CrushMult + CutMult) / 2)`.\n* Осуществлена общая ценовая балансировка более 800 единиц брони.\n* Сбалансированы параметры и цены на устройства с использованием другой формулы.\n* Проделана большая работа по очистке сборки, что, по наблюдениям, оптимально сказалось на производительности.\n* Были перестроены некоторые основные города.\n* И самое важное, мы нашли и устранили причину вылетов, которые мучали вас в последнее время. Теперь вылетов быть не должно!\n\nПроделана огромная работа, спасибо вам за поддержку и обратную связь, только благодаря вам сборка становится лучше. ПЕРЕНОС СОХРАНЕНИЯ ОБЯЗАТЕЛЕН."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.1.1,0 уже здесь!",
        "content": "Мы рады представить вам новое обновление v6.1.1,0 для Kenshi REBORN! Это обновление включает в себя исправления и улучшения, направленные на оптимизацию игрового процесса.\n\nЧто нового и что исправлено:\n\n* Скорректирована скорость производства и вместимость хранилища Автоматического производственного комплекса.\n* Скорректирован максимальный допустимый уровень прокачки Древними методами обучения.\n* Скорректированы некоторые названия.\n* Внесены небольшие исправления и улучшения.\n\nИнформация касательно вылетов:\n\nПо имеющейся информации, перенос сохранения, который требовался после установки предыдущего обновления, устраняет возможные проблемные вылеты. Если вы уже делали перенос сохранения после предыдущего обновления, то в этот раз он не требуется."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.1.0,1 уже здесь!",
        "content": "Мы рады представить вам новое обновление v6.1.0,1 для Kenshi REBORN! Это обновление включает в себя исправления и небольшие доработки, которые сделают ваше приключение в мире Kenshi еще более комфортным и стабильным.\n\nЧто нового и что исправлено в v6.1.0,0:\n\n* Большинство блюд, которые ранее были недоступны, теперь можно приготовить. Они разделены по фракциям, и для их изучения потребуются книги рецептов этих фракций. Всего доступно 6 групп рецептов: союзные, шеки, святые, болотники, улей и людоеды.\n* Устранена причина вылета в городе Чёрная Ссадина.\n* Произведена ценовая балансировка ядра ИИ и Книги для инженерных исследований.\n* Исправлен крафт арбалетных частей.\n* Внесены мелкие исправления и балансировки.\n\nПо неизвестным причинам начали появляться случаи вылета при загрузке различных городов. В логе причину ошибки не пишет, и саму проблему выявить очень тяжело. Поэтому мы предупреждаем вас и даем список возможных проблемных городов, при загрузке которых возможен вылет:\n\n* Шо-Баттаи\n* Чёрная Ссадина (исправлено)\n* Цитадель Чёрной Бороды\n* Траур\n* Тортуга\n* Стоат\n* Скуин\n* Семолина\n* Ровная Лагуна\n* Проход Тщеты\n* Последний бой\n* Последнее пристанище\n* Меченосец (исправлено)\n* Локи\n* Катун\n* Карси\n* Груз\n* Грань\n* Великая крепость\n* Адмаг\n* Авалон\n\nЧто нового и что исправлено в v6.1.0,1:\n\n* Скорректировано название физической модели здания.\n* Внесены небольшие корректировки, касающиеся предметов.\n* Предпринята попытка устранить вылеты.\n\nПЕРЕНОС СОХРАНЕНИЯ ОБЯЗАТЕЛЕН. Также мы просим энтузиастов проверить на вылеты следующие города: Меченосец, Чёрная Ссадина. Если вылеты присутствуют, пожалуйста, сообщите об этом в удобные для вас места."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.0.8,1 уже здесь!",
        "content": "Мы рады представить вам новое обновление v6.0.8,1 для Kenshi REBORN! Это обновление включает в себя исправления и небольшие доработки, которые сделают ваше приключение в мире Kenshi еще более комфортным и стабильным.\n\nЧто было в обновлении v6.0.8:\n\n* Комплект брони Импалера и комплект брони гидравлического рыцаря теперь доступны к созданию.\n* Исправлена проблема, когда окно с броней вылезало за пределы экрана после открытия болтокоробок.\n* Добавлены новые хранилища для различной электроники, такой как энергоядро, нанокабель, фазосталь, энергоиндуктор, ЦПУ и других.\n* Внесены небольшие корректировки.\n\nЧто нового в обновлении v6.0.8.1:\n\n* Устранён вылет при загрузке города Меченосец.\n* Мелкие корректировки.\n\nПеренос сохранения, скорее всего, не требуется."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.0.7,1 уже здесь!",
        "content": "Мы продолжаем улучшать ваш игровой опыт в мире Kenshi REBORN и рады представить обновление v6.0.7,1! Это обновление включает в себя важные изменения и корректировки, направленные на улучшение баланса и экономики игры, а также небольшие исправления.\n\nЧто изменено в v6.0.7:\n\n* Внесены корректировки в цену простой аптечки, хорошей аптечки и стандартной аптечки.\n* Скорректирована цена пергамента, пергамента для чертежей и книг для исследований.\n* Изменено количество денег у большинства торговцев в игре в связи с выходом нового дополнения для сборки (ранее упакованный алкоголь было некому продавать из-за нехватки денег у NPC).\n\nЧто нового в v6.0.7.1:\n\n* Печь для переплавки теперь снова производит руду.\n* Внесены новые небольшие корректировки.\n\nОБЯЗАТЕЛЬНО НУЖНО СДЕЛАТЬ ПЕРЕНОС СОХРАНЕНИЯ, ИНАЧЕ ДЕНЬГИ У ТОРГОВЦЕВ ОСТАНУТСЯ БЕЗ ИЗМЕНЕНИЙ."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.0.6,0 уже здесь!",
        "content": "Мы продолжаем улучшать ваш игровой опыт в мире Kenshi REBORN и рады представить обновление v6.0.6,0! Это обновление включает в себя множество исправлений и улучшений, направленных на оптимизацию игрового процесса.\n\nЧто нового и что исправлено:\n\n* Внесены изменения в произрастание культур по биомам.\n* Печь для переплавки теперь производит слитки железа.\n* Ящик для хранения кольчуг стал доступен.\n* Хранилище пиломатериалов разделено на контейнер для досок и контейнер для брусов.\n* Исправлена вместимость контейнера с железными листами.\n* Убраны проблемные места у Башни Пыльного Короля.\n* Исправлен Ткацкий станок [конопля].\n\nПеренос сохранения не требуется."
    },
    {
        "title": "Обновление Kenshi REBORN до версии v6.0.5,0 уже здесь!",
        "content": "Мы продолжаем улучшать ваш игровой опыт в мире Kenshi REBORN и рады представить обновление v6.0.5,0! Это обновление включает в себя множество исправлений, улучшений и новый контент, которые сделают ваши приключения еще более захватывающими.\n\nЧто нового и что исправлено:\n\n* Расширен ассортимент в магазине кибернетики.\n* Добавлена анимация атаки Болотной черепахи.\n* Внесены корректировки в прочность конечностей черепахи, шанс попадания по конечностям, а также в характеристики.\n* Убрана потребность в рабочем у Печи для переплавки.\n* Добавлена новая вариация для Башни Пыльного короля.\n* Простая аптечка теперь создается не из 5 хлопка, а из 3, что сказалось на цене.\n* Самурайские доспехи, которые отсутствовали в списке создаваемых предметов, теперь там есть и доступны к созданию.\n* Внесены мелкие корректировки и исправления."
    }
]
